### Starter code for Project 3.
#### Run these cells before starting the assignment.

#### 1. create BQ dataset:

In [ ]:
%env dataset_id=school_enrollments

env: dataset_id=school_enrollments

In [ ]:
!bq --location=US mk --dataset $dataset_id

BigQuery error in mk operation: Dataset 'databases-sp-vs-24:school_enrollments'
already exists.

#### 2. create and populate BQ tables:

In [ ]:
import os

In [ ]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access-2/school-enrollments/*"
file_listings = os.popen(gsutil_cmd)
dataset="school_enrollments"

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]

    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset + "." + table + ' ' + file
    print(bq_cmd)

    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ak.csv

Waiting on bqjob_r73f4fa30c540608f_0000018e6734e10f_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ar.csv

Waiting on bqjob_r397f901fdb146eda_0000018e6734f3c5_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ca.csv

Waiting on bqjob_r705291ee5e839cb_0000018e67350ee3_1 ... (14s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ct.csv

Waiting on bqjob_r277c6dbf8288c94f_0000018e673552b8_1 ... (3s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access-2/school-enrollments/zf406jp4427_hi.csv

Waiting on bqjob_r76f15c871eaa71d8_0000018e67356984_1 ... (2s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access-2/school-enrollments/zf406jp4427_la.csv

Waiting on bqjob_r59eb124bfb8554b5_0000018e67357cbd_1 ... (4s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access-2/school-enrollments/zf406jp4427_md.csv

Waiting on bqjob_rec13efebf50f4d6_0000018e673597a8_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access-2/school-enrollments/zf406jp4427_mn.csv

Waiting on bqjob_r530ddf930e23075f_0000018e6735aad2_1 ... (5s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ms.csv

Waiting on bqjob_r7fcd4a6a04c15a0b_0000018e6735c9d8_1 ... (2s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nh.csv

Waiting on bqjob_r772377d5dde090a3_0000018e6735dc3e_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nv.csv

Waiting on bqjob_r35b98e594b75d366_0000018e6735eedb_1 ... (2s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ok.csv

Waiting on bqjob_r2d66f2052914b372_0000018e67360190_1 ... (4s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_pa.csv

Waiting on bqjob_r15bb71688a7be1f4_0000018e67361c9b_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access-2/school-enrollments/zf406jp4427_sc.csv

Waiting on bqjob_r3b4c812b86a61c11_0000018e6736379c_1 ... (2s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access-2/school-enrollments/zf406jp4427_tx.csv

Waiting on bqjob_r7ef96d90a92833c3_0000018e67364a4a_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wa.csv

Waiting on bqjob_r6dad6d85d705157d_0000018e6736662c_1 ... (4s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wy.csv

Waiting on bqjob_r50b38117b986c09c_0000018e67368172_1 ... (2s) Current status: DONE

#### 3. Find school enrollments by school name, grade level, and year for Texas

In [ ]:
!bq show --schema=true $dataset_id.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [ ]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query is running:   0%|          |

Downloading:   0%|          |

         school             grade  year  total
0     AKINS H S          grade_10  2020   2880
1     AKINS H S          grade_10  2021   2988
2     AKINS H S          grade_11  2020   2656
3     AKINS H S          grade_11  2021   2652
4     AKINS H S          grade_12  2020   2436
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    276
1735  ZILKER EL      kindergarten  2020    308
1736  ZILKER EL      kindergarten  2021    252
1737  ZILKER EL  pre_kindergarten  2020    120
1738  ZILKER EL  pre_kindergarten  2021     52

[1739 rows x 4 columns]

##### Documentation on BQ's string functions: https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [ ]:
!bq --location=US mk --dataset "views"

BigQuery error in mk operation: Dataset 'databases-sp-vs-24:views' already
exists.

In [ ]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year1 as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query is running:   0%|          |

Empty DataFrame
Columns: []
Index: []

In [ ]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query is running:   0%|          |

Downloading:   0%|          |

         school             grade  year  total
0     AKINS H S          grade_10  2020   2880
1     AKINS H S          grade_10  2021   2988
2     AKINS H S          grade_11  2020   2656
3     AKINS H S          grade_11  2021   2652
4     AKINS H S          grade_12  2020   2436
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    276
1735  ZILKER EL      kindergarten  2020    308
1736  ZILKER EL      kindergarten  2021    252
1737  ZILKER EL  pre_kindergarten  2020    120
1738  ZILKER EL  pre_kindergarten  2021     52

[1739 rows x 4 columns]

#### 4. Open Data Studio and create a chart from this view:
##### https://datastudio.google.com/

#### Project 3 homework marker. Start homework from here.

In [ ]:
%%bigquery
SELECT school, COUNT(*) AS num_years_with_enrollment_gt_500
FROM (
    SELECT school, year, SUM(CAST(REPLACE(REPLACE(total, ",", ""), "<", "") AS INT64)) AS total_enrollment
    FROM school_enrollments.tx
    WHERE total != "" AND school != "" AND district LIKE '%AUSTIN%'
    GROUP BY school, year
    HAVING total_enrollment > 500
)
GROUP BY school
ORDER BY num_years_with_enrollment_gt_500 DESC;

Query is running:   0%|          |

Downloading:   0%|          |

                 school  num_years_with_enrollment_gt_500
0    AUSTIN ACHIEVE H S                                 2
1             AKINS H S                                 2
2          ANDERSON H S                                 2
3            AUSTIN H S                                 2
4             BOWIE H S                                 2
..                  ...                               ...
127           BROOKE EL                                 1
128           NORMAN EL                                 1
129            PEASE EL                                 1
130             SIMS EL                                 1
131     WEBB PRI CENTER                                 1

[132 rows x 2 columns]

This query counts the number of years for each school in Austin where the total enrollment is greater than 500.

In [ ]:
%%bigquery
SELECT school, year, MAX(CAST(REPLACE(REPLACE(total, ",", ""), "<", "") AS INT64)) AS max_enrollment
FROM school_enrollments.tx
WHERE total != "" AND school != ""
GROUP BY school, year
ORDER BY year;

Query is running:   0%|          |

Downloading:   0%|          |

                                   school  year  max_enrollment
0                     A+ SECONDARY SCHOOL  2020             125
1                          ABERNATHY DAEP  2020              10
2                           ABERNATHY H S  2020              69
3                             ABILENE H S  2020             647
4      ACADEMY FOR TECHNOLOGY ENGINEERING  2020              95
...                                   ...   ...             ...
15944          FARRIS EARLY CHILDHOOD CTR  2021             206
15945                NORTHWEST HEAD START  2021              49
15946        ROARK EARLY EDUCATION CENTER  2021             123
15947               PARKLAND PRE K CENTER  2021             127
15948                    YSLETA PK CENTER  2021             249

[15949 rows x 3 columns]

This query finds the Max enrollment number of each school in the dataset

In [ ]:
%%bigquery
SELECT state, county, district, SUM(total) as total_sum
FROM (
    SELECT state, county, district, total
    FROM school_enrollments.ca
    WHERE county = 'ALAMEDA'
    UNION DISTINCT
    SELECT state, county, district, total
    FROM school_enrollments.ca
    WHERE county = 'LOS ANGELES'
) combined_results
GROUP BY state, county, district
ORDER BY total_sum;

Query is running:   0%|          |

Downloading:   0%|          |

,state,county,district,total_sum
0,CA,ALAMEDA,Mountain House Elementary,69.0
1,CA,ALAMEDA,California School for the Blind (State Special...,102.0
2,CA,ALAMEDA,California School for the Blind (State Special...,198.0
3,CA,LOS ANGELES,SBE - Los Angeles College Prep Academy,306.0
4,CA,ALAMEDA,SBE - Latitude 37.8 High,492.0
...,...,...,...,...
106,CA,LOS ANGELES,Antelope Valley Union High,134186.0
107,CA,ALAMEDA,Fremont Unified,179364.0
108,CA,ALAMEDA,Oakland Unified,205482.0
109,CA,LOS ANGELES,Long Beach Unified,342444.0
110,CA,LOS ANGELES,Los Angeles Unified,1882115.0

The query finds total enrollments in Alameda county and los angeles county and joins them through a union from the california data set.

In [ ]:
%%bigquery
SELECT county, COUNT(county) as county_count
FROM school_enrollments.tx
WHERE admin_level = 'school'
GROUP BY county
ORDER BY county_count;

Query is running:   0%|          |

Downloading:   0%|          |

              county  county_count
0      KENEDY COUNTY            72
1      BORDEN COUNTY           116
2       FOARD COUNTY           120
3        KING COUNTY           120
4    MCMULLEN COUNTY           120
..               ...           ...
248   HIDALGO COUNTY         21020
249   TARRANT COUNTY         28064
250     BEXAR COUNTY         31088
251    DALLAS COUNTY         42024
252    HARRIS COUNTY         55936

[253 rows x 2 columns]

This gives the sum of each county where the admin level is school. It is grouped by county and ordered by the counts per county.

In [ ]:
%%bigquery
SELECT county, COUNT(county) as county_count
FROM school_enrollments.ca
GROUP BY county
HAVING COUNT(county) > 20000
ORDER BY county_count;

Query is running:   0%|          |

Downloading:   0%|          |

            county  county_count
0        SAN MATEO         23408
1           TULARE         24024
2       STANISLAUS         24528
3           SONOMA         25144
4          VENTURA         26096
5      SAN JOAQUIN         28728
6             KERN         32872
7     CONTRA COSTA         33768
8           FRESNO         41160
9       SACRAMENTO         44968
10         ALAMEDA         45696
11     SANTA CLARA         51352
12       RIVERSIDE         59192
13  SAN BERNARDINO         67368
14          ORANGE         74368
15       SAN DIEGO         91840
16     LOS ANGELES        261744

This counts the counties counties the california school enrollment dataset. it filters the counts that are greater than 20000 and orders by the county counts.

In [ ]:
%%bigquery
SELECT state, county, district, SUM(total) as total_sum
FROM (
    SELECT state, county, district, total
    FROM school_enrollments.pa
    WHERE county = 'Lycoming'
    UNION DISTINCT
    SELECT state, county, district, total
    FROM school_enrollments.pa
    WHERE county = 'Montgomery'
) combined_results
GROUP BY state, county, district
HAVING total_sum > 3000
ORDER BY total_sum LIMIT 10;

Query is running:   0%|          |

Downloading:   0%|          |

  state      county                              district  total_sum
0    PA  Montgomery  Central Montco Technical High School     3508.0
1    PA  Montgomery                         Jenkintown SD     3864.0
2    PA  Montgomery       North Montco Tech Career Center     4112.0
3    PA    Lycoming                    Montgomery Area SD     5278.0
4    PA    Lycoming                              Muncy SD     5500.0
5    PA    Lycoming            South Williamsport Area SD     6836.0
6    PA    Lycoming                 Loyalsock Township SD     7799.0
7    PA  Montgomery               Pennsylvania Virtual CS     8488.0
8    PA    Lycoming                      East Lycoming SD     9858.0
9    PA    Lycoming                 Montoursville Area SD    12260.0

The query finds total enrollments in Montgomery county and Lycoming county and joins them through a union from the Pennsylvania data set.

In [ ]:
%%bigquery
SELECT district, COUNT(district) as district_count
FROM school_enrollments.ar
GROUP BY district
HAVING COUNT(county) <= 2000
ORDER BY district_count;

Query is running:   0%|          |

Downloading:   0%|          |

                                              district  district_count
0                   HOPE ACADEMY OF NORTHWEST ARKANSAS              64
1                               BARTON SCHOOL DISTRICT              64
2                          HOPE ACADEMY OF NW ARKANSAS              64
3    RESPONSIVE ED SOLUTIONS PREMIER HIGH SCHOOL OF...              64
4    RESPONSIVE ED SOLUTIONS PREMIER HIGH SCH OF NO...              64
..                                                 ...             ...
226                          DOLLARWAY SCHOOL DISTRICT            1920
227                            CLINTON SCHOOL DISTRICT            1920
228                      PRAIRIE GROVE SCHOOL DISTRICT            1920
229                            TRUMANN SCHOOL DISTRICT            1984
230                     OUACHITA RIVER SCHOOL DISTRICT            1984

[231 rows x 2 columns]

This code gets the district counts for each district and filters the counts that are less than or equal to 2000. This is ordered by district counts for Arkansas.

In [ ]:
%%bigquery
SELECT district, county_state_id, COUNT(*) as id_count
FROM school_enrollments.ca
GROUP BY district, county_state_id
ORDER BY id_count;

Query is running:   0%|          |

Downloading:   0%|          |

                       district  county_state_id  id_count
0              SBE - OnePurpose             6075        56
1             Elkins Elementary             6103        56
2          SBC - High Tech High               37        56
3         SBE - John Henry High             6013        56
4     SBE - Olive Grove Charter             6083        56
...                         ...              ...       ...
2032             Fresno Unified             6019     12040
2033            Oakland Unified             6001     13216
2034      San Francisco Unified             6075     13664
2035          San Diego Unified             6073     24808
2036        Los Angeles Unified             6037    113120

[2037 rows x 3 columns]

The counts for each county id are listed. It is ordered by the counts.

In [ ]:
%%bigquery
CREATE VIEW school_enrollments.viewTX AS
SELECT school, year, MAX(CAST(REPLACE(REPLACE(total, ",", ""), "<", "") AS INT64)) AS max_enrollment
FROM school_enrollments.tx
WHERE total != "" AND school != ""
GROUP BY school, year
ORDER BY year;

Query is running:   0%|          |

Empty DataFrame
Columns: []
Index: []

The maximum enrollments for each school in texas are listed. It is ordered by year. The view is created.

In [ ]:
%%bigquery
CREATE VIEW school_enrollments.viewCA AS
SELECT state, county, district, SUM(total) as total_sum
FROM (
    SELECT state, county, district, total
    FROM school_enrollments.ca
    WHERE county = 'ALAMEDA'
    UNION DISTINCT
    SELECT state, county, district, total
    FROM school_enrollments.ca
    WHERE county = 'LOS ANGELES'
) combined_results
GROUP BY state, county, district
ORDER BY total_sum;

Query is running:   0%|          |

Empty DataFrame
Columns: []
Index: []

The view is created for the total enrollments in Alameda county and los angeles county.